package com.codesroots.hossam.lordApp.presentation.screens;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.Html;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

import com.codesroots.hossam.lordApp.R;

public class ContionsActivity extends AppCompatActivity {

    TextView textView;

    String text ="ان موافقتك على الشروط و السياسات يعني انك موافق علم ما يلي\n" +
            "قد نقوم بجمع المعلومات التالية من مستخدمي خدماتنا : الاسم الأول واسم العائلة وعنوان الشارع والمنطقة والمدينة، وارقام الهاتف والاتصال، وعنوان البريد الإلكتروني ،) ، \"المعلومات التي يمكن تحديدها شخصيا \" و\" PII \")بالإضافة إلى ذلك ، قد يقوم لورد بجمع المعلومات المتعلقة بالطلبات السابقة عبر لورد لأصحاب حسابات لورد، والمطاعم المفضلة لديك ، واستفسارات خدمة العملاء ، واستعراضات الخدمة\n" +
            "\n" +
            "قد يقوم لورد أيضا باستخدام برمجيات تحليلات الويب لمتابعة وتحليل حركة المرور على الموقع فيما يخص اعلانات لورد وترويج خدمات لورد. ويجوز ان يقوم لورد بنشر هذه الإحصاءات أو مشاركتها مع أطراف ثالثة غير شامل المعلومات الشخصية PII يتم تجميع المعلومات غير الشخصية  وغيرها من المعلومات التي لا تكشف عن الهوية الخاصة بك. ويجوز ان نقوم نحن مع طرف ثالث من مقدمي الخدمة من الغير بجمع معلومات غير PII ، بما في ذلك عنوان الخاص بك ، ونوع الكمبيوتر الخاص بك ودقة الشاشة ، إصدار نظام التشغيل، ومتصفح الانترنت والبيانات الديموغرافية، على سبيل المثال الموقع الخاص بك والجنس وتاريخ الميلاد، PII بأسلوب بحيث أن المنتج النهائي لا يحددك شخصيا أو أي مستخدم آخر للموقع، وعلى سبيل المثال، استخدام PII لحساب النسبة المئوية لمستخدمينا الذين لديهم رمز منطقة هاتف محدد، وقد نقوم نحن مع الطرف الثالث من مقدم الخدمة أيضا باستخدام الكوكيز، علامات بكسل، عدادات الويب، والتكنولوجيات الأخرى المشابهة لتقديم خدمة أفضل لكم مع مزيد من المعلومات المصممة وتسهيل استخدامك المستمر لموقعنا. إذا كنت لا ترغب في جمع المعلومات من خلال استخدام الكوكيز، هناك إجراءات بسيطة في معظم المتصفحات التي تسمح لك برفض استخدام \n" +
            "\n" +
            "عناوين IP هي عناوين بروتوكول الإنترنت لأجهزة الكمبيوتر التي تستخدمها. يتم تلقائيا تعيين عنوان IPالخاص بك إلى جهاز الكمبيوتر الذي تستخدمه عن طريق موفر خدمة إنترنت (ISP). يتم تحديد هذا الرقم وتسجيله تلقائيا في ملفات السجل على الخادم الخاص بنا عند قيام المستخدمين بزيارة الموقع، جنبا إلى جنب مع وقت هذه الزيارة والصفحة التي تم زيارتها. جمع عناوين IP هو الممارسة القياسية على شبكة الانترنت ويتم ذلك تلقائيا من قبل العديد من المواقع على شبكة الإنترنت\n" +
            "\n" +
            "لورد عبارة عن وساطة دعائية بين مقدم الخدمة او صاحب المتجر و المستفيد او المستخدم  و نحن غير مسؤولين قانونيا عن اي اخلال او سهو او خطأ بالاتفاقات التجارية المبرمة بين الطرفين و هذا التطبيق لا يضمن نوعية الخدمات المقدمة او المنتجات المباعة  لكننا نحاول مساعدة عملائنا فيما يخص الجودة عن طريق توفير قسم مخصص لتقييم المنتجات و التعليق عليها و تجدر الاشارة الى انه في حال كان الخطأ من جانب صاحب المتجر فيتحمل هو عمولة التوصيل اما اذا اعترض المشتري على السلعة من دون وجود احتيال او نصب او خطأ في التجهيز فيتحمل المشتري عمولة التوصيل  (في حالة وجود عمولة توصيل).\n" +
            "لغرض تسجيل حساب، نحن نطلب منك تزويدنا بعنوان بريدك الالكتروني واي معلومات أخرى مطلوبة للاتصال بك عبر الانترنت وعبر الهاتف. نحن نستخدم عنوان بريدك الالكتروني ومعلومات الاتصال الاخرى التي تقوم بتقديمها الينا للتأكيد على طلبك وابلاغك في حالة وجود مشكلة في الطلب ، لذلك لا يمكن لشخص التسجيل بدون عنوان بريد الكتروني. وفي حالة تسجيل عنوان البريد الإلكتروني ، يمكنك الدخول اليه فيما بعد وتحديثه وتعديله وحذف أي بيانات غير دقيقة عن طريق الدخول الى حسابك من خلال رابط معلومات \"حسابي\" في الصفحة الرئيسية للمستخدم. كما يمكنك ايضا ببساطة عدم تزويدنا بعنوان بريدك الالكتروني، ولكنك لن تتمكن من التسجيل على موقع الشبكة وتقديم طلبات . نحن نبلغ جزء من معلومات الاتصال بك (الاسم واسم العائلة وعنوان توصيل الطلب ورقم الهاتف) الى المتجر او مقدم الخدمة العضو الذي قمت بتقديم الطلب اليه. كما أننا نستخدم هذه المعلومات ايضا لتسهيل تحسين استخدامك للموقع والتواصل معك ولاستخدامات داخلية والالتزام بأي متطلبات قانونية. ويجوز الكشف عن هذه المعلومات الى موظفينا والى جميع المشاركين في تنفيذ طلبك او لتحليل ودعم استخدامك للموقع.\n" +
            "اننا لا نبيع ولن نقوم بالكشف عن معلومات الاتصال الشخصية الخاصة بك الى الغير بخلاف ما هو محدد في سياسة الخصوصية الماثلة بدون تصريح منك وما لم يحق لنا او نكون ملزمين بالقيام بذلك (على سبيل المثال في حالة ضرورة قيامنا بذلك بموجب امر من المحكمة او لأغراض منع الاحتيال او أي جريمة اخرى ..\n" +
            "المعلومات الشخصية المطلوبة اثناء تنفيذ الطلب تشمل الاسم والعنوان ورقم الهاتف وعنوان البريد الالكتروني والمعلومات الاخرى المشابهة المستخدمة للتعريف عنك وانجاز الطلب.\n" +
            "\n" +
            "المعلومات الشخصية التي يتم جمعها في موقعنا سوف يتم مشاركتها مع المتجر عند تنفيذ طلبك. ان لدينا اتفاقية مع كافة المتاجر الاعضاء التي تقيد التصريح عن او المعالجة الاضافية للمعلومات المقدمة لهم من جانبنا. ان معلوماتك الشخصية سوف يتم استخدامها لإبلاغك بوضع طلبك. ولن يتم مشاركة المعلومات الشخصية مع أي من شركاء العمل لدينا او الشركات الزميلة بدون تصريح منك فسوف يتم التعامل معها بسرية ولن يتم الكشف عنها الى الاطراف الخارجية، ما لم نكون مضطرين لذلك بموجب التشريعات المعمول بها. اننا نقوم فقط بإرسال رسائل الكترونية خاصة بالتسويق الى اولئك الاشخاص الذين قاموا تحديدا بطلب استلام هذه المعلومات.\n" +
            "\n" +
            "نحن لا نقوم ببيع او تأجير معلوماتك الشخصية الى الغير لأغراض التسويق الخاصة بهم بدون موافقة صريحة منك. وقد نقوم بجمع معلوماتك مع معلومات نقوم بجمعها من الشركات الاخرى واستخدامها لتحسين وتخصيص خدماتنا ومحتوياتنا واعلاناتنا. في حالة عدم رغبتك في استلام مراسلات التسويق في حال وجودها منا عن طريق البريد الالكتروني او المشاركة في برامج تخصيص الاعلانات لدينا، ما عليك الا القيام ببساطة بإبلاغنا باختيارك بالبريد الالكتروني او الدخول الى حسابك على الموقع وتغيير الوضعيات ذات الصلة من رابط \"حسابي\" في الصفحة الرئيسية للمستخدم.\n" +
            "\n" +
            "قد نقوم بالكشف عن معلوماتك الشخصية الى موظفينا والى أي طرف من المشاركين في توصيل طلبك وتحليل ودعم استخدامك للموقع. وقد نقوم بالكشف عن معلوماتك عند الضرورة لحماية حقوقنا القانونية، في حالة ان المعلومات تتعلق بسلوك ضار بطريقة فعلية او حتى مجرد مهدد به، او لدينا اعتقاد بنية حسنة ان هذا الاجراء ضروري من اجل (1) الالتزام بمتطلبات القانون او الالتزام بالأوامر الحكومية وقرارات المحكمة او الاجراءات القانونية المقدمة الينا او (2) لحماية والدفاع عن ممتلكاتنا او حقوقنا الاخرى، ومستخدمي الموقع او الجمهور. ويتضمن ذلك تبادل المعلومات مع الشركات والمؤسسات الاخرى للحماية من الاحتيال\n" +
            "\n" +
            "\n" +
            "قد نقوم بالكشف عن معلومات الشخصية PII:\n" +
            "الى مقدمي الخدمة من الغير الذين يقدمون الخدمات مثل استضافة موقع الشبكة وتحليل البيانات وتنفيذ الدفع وتلبية الطلبات وتقديم البنية التحتية وخدمات تكنولوجية المعلومات وخدمة العملاء وخدمات ارسال البريد الالكتروني والخدمات الاخرى المشابهة لتمكينهم من تقديم الخدمات  \n" +
            "\n" +
            "نحن نستخدم اجراءات تنظيمية وفنية وادارية على قدر الامكان لحماية معلومات التي تكون تحت سيطرتنا ولكن لسوء الحظ، لا يمكن ضمان ارسال البيانات عبر الانترنت او نظام تخزين البيانات لكي يكون أمن بنسبة 100%. يرجى عدم ارسال المعلومات الحساسة الينا بالبريد الالكتروني. اذا كان لديك سبب لاعتقاد ان تواصلك معنا لم يعد أمن (على سبيل اذا شعرت ان امن أي حساب لك معنا تم تعرضه للخطر) يتعين عليك ان تبلغنا فورا بالمشكلة عن طريق الاتصال بنا وفقا للقسم \"الاتصال بنا\" (يرجى الملاحظة انه في حالة اختيارك لإبلاغنا بالبريد العادي، فإن ذلك سوف يؤخر الوقت المستغرق من جانبنا للاستجابة نحو المشكلة)\n" +
            "ان سياسة الخصوصية هذه لا تتناول (ونحن غير مسؤولين) خصوصية المعلومات او الممارسات الاخرى الخاصة بالغير، بما في ذلك وبدون حصر أي من شركاتنا الزميلة واي طرف ثالث يقوم بتشغيل أي موقع يحتوي هذا الموقع على رابط خاص به. ان وجود رابط في الموقع لا يعني الموافقة على الموقع الموصل من جانبنا او من جانب شركاتنا الزميلة.\n" +
            "\n" +
            "و تجدر الاشارة الى امكانية تغيير سياسة الخصوصية في أي وقت عن طريق نشر الاصدار الجديد على الموقع الإلكتروني";
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_contions);

        textView =  findViewById(R.id.text);
        textView.setMovementMethod(new ScrollingMovementMethod());
        textView.setText(Html.fromHtml(text));
    }
}
